app/Controllers/Auth.php

    public function processLogin()
    {
        // $session = session();
        $userModel = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        if (empty($email) || empty($password)) {
            return redirect()->to('/')->with('error', 'Email dan password wajib diisi.');
        }

        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@example.com'
 LIMIT 1