app/Controllers/User.php

    public function index()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/')->with('error', 'Akses anda ditolak');
        }
        $data['users'] = $this->userModel->findAll();
---
SELECT *
FROM `users`

    public function store()
    {
        $this->userModel->save([
            'name'      => $this->request->getPost('name'),
            'email'     => $this->request->getPost('email'),
            'password'   => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'job'        => $this->request->getPost('job'),
            'department' => $this->request->getPost('department'),
            'salary'     => $this->request->getPost('salary'),
        ]);
---
INSERT INTO `users` (`name`, `email`, `password`, `job`, `department`, `salary`, `created_at`, `updated_at`) VALUES ('Michael', 'michael@example.com', '$2y$10$oByQ.ysW12d5YkS1lyqS7uDnVGkl353DUBt7wRMklbtTV1BfKqYv2', 'UI / UX', 'Design', '4700000', '2025-02-14 18:28:25', '2025-02-14 18:28:25')

    public function edit($id)
    {
        $data['user'] = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'

    public function update($id)
    {
        $userModel = new UserModel();

        $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'