app/Models/UserModel.php

UPDATE `users` SET `name` = 'Dani', `email` = 'Dani@example.com', `job` = 'Lead DevOps', `department` = 'IT', `salary` = '5350000', `updated_at` = '2025-02-14 18:27:02'
WHERE `id` = '2'
---
    public function updateUser($id, $data)
    {
        if (!empty($data['password'])) {
            $data['password'] = password_hash($data['password'], PASSWORD_DEFAULT);
        } else {
            unset($data['password']);
        }

        return $this->where('id', $id)->set($data)->update();